{"inputs": "<s>### Instruction:\nWhat are the basic rules for movement in Necromunda?\n\n### Response:\nIn Necromunda, movement is measured in inches and a fighter can move up to their Movement (M) characteristic in any direction. Fighters can climb or descend ladders and vertical surfaces up to their Movement characteristic as well, but moving through difficult terrain halves their movement. Jumping gaps is possible, but requires a check if the gap is wider than 2 inches.</s>"}
{"inputs": "<s>### Instruction:\nHow does shooting work in Necromunda?\n\n### Response:\nIn Necromunda, shooting involves checking the line of sight, measuring range, and then rolling to hit based on the shooter's Ballistic Skill (BS). Cover affects the hit roll, providing penalties for partial or full cover. If a hit is successful, a wound roll is made comparing the weapon's strength to the target's toughness. If the wound is successful, the target makes an armor save roll. Damage is applied if the save fails.</s>"}
{"inputs": "<s>### Instruction:\nWhat is the process for resolving close combat in Necromunda?\n\n### Response:\nClose combat in Necromunda is resolved by both fighters making a number of attack rolls based on their Attacks characteristic and comparing each roll to their Weapon Skill (WS) to determine hits. Each hit then goes through a wound roll, followed by the target's armor save roll if applicable. Close combat continues until one fighter is down, retreats, or the combat ends in a stalemate.</s>"}
{"inputs": "<s>### Instruction:\nExplain how gang creation works in Necromunda.\n\n### Response:\nGang creation in Necromunda starts by choosing a house or faction, then allocating a set amount of credits to purchase fighters, weapons, and equipment. Each fighter has a type, like Leader, Ganger, or Juve, with specific roles and restrictions. Equipment and weapons are selected from the gang's house list. The gang must meet minimum requirements for fighter types, and players can customize their gang's name and colors.</s>"}
{"inputs": "<s>### Instruction:\nHow do you handle injuries and recovery in Necromunda?\n\n### Response:\nInjuries in Necromunda are resolved post-battle, where fighters can suffer from temporary or permanent effects based on injury rolls. The post-battle sequence involves making recovery rolls for each downed fighter to determine their fate, ranging from full recovery to death. Medical care and certain skills can influence these outcomes, and some injuries may result in permanent stat decreases or special conditions.</s>"}
{"inputs": "<s>### Instruction:\nCan you describe how territory control and income work in Necromunda?\n\n### Response:\nTerritory control in Necromunda is a key part of campaign play, where gangs fight to control areas that provide various benefits, including income in credits, special resources, or strategic advantages. Income from territories is collected at set campaign intervals, and can be used to recruit new fighters, purchase equipment, or pay for other expenses. Controlling more territories often means a gang can grow more powerful over time.</s>"}
{"inputs": "<s>### Instruction:\nWhat are the main types of weapons in Necromunda, and how do they differ?\n\n### Response:\nNecromunda features a wide range of weapons, categorized mainly into melee weapons, pistols, basic weapons, special weapons, and heavy weapons. Melee weapons are used in close combat, pistols can be used in close combat and shooting, basic weapons are general-purpose firearms, special weapons have unique abilities or effects, and heavy weapons are powerful but come with restrictions on movement and usage.</s>"}
{"inputs": "<s>### Instruction:\nExplain the role of skills in Necromunda.\n\n### Response:\nSkills in Necromunda provide fighters with special abilities or bonuses that can influence the outcome of battles. Skills are divided into categories based on fighter types and can include combat enhancements, shooting accuracy improvements, movement abilities, and leadership or morale boosts. Fighters gain skills as they gain experience in campaigns, allowing for customization and specialization within the gang.</s>"}
{"inputs": "<s>### Instruction:\nHow does the campaign system work in Necromunda?\n\n### Response:\nNecromunda's campaign system allows players to engage in a series of connected games, where gangs grow and evolve over time. Campaigns involve fighting for control of territories, managing resources, and dealing with injuries and deaths. Players participate in scenarios that have varying objectives, and outcomes affect the gang's wealth, territories, and fighter experience. Campaigns can last for a predetermined number of games or until certain conditions are met.</s>"}
{"inputs": "<s>### Instruction:\nWhat is the significance of house allegiances in Necromunda?\n\n### Response:\nHouse allegiances in Necromunda determine a gang's culture, background, and available resources, including fighters, weapons, and equipment. Each house has unique traits, strengths, and weaknesses, influencing a gang's playstyle and strategies. Allegiances can also affect alliances and rivalries within the game's narrative and campaign interactions, adding depth to the game's lore and player choices.</s>"}