[
  "cannoli",
  "ai-templater",
  "dataview",
  "obsidian-dice-roller",
  "eleven-labs",
  "obsidian-excalidraw-plugin",
  "excalibrain",
  "initiative-tracker",
  "obsidian-leaflet-plugin",
  "numerals",
  "progressbar",
  "templater-obsidian",
  "obsidian-textgenerator-plugin",
  "table-editor-obsidian",
  "automatic-table-of-contents",
  "notion-like-tables"
]